MAX_X1 = 18.0     # расход топлива, л/100 км
MAX_X2 = 400.0    # мощность, л.с.
MAX_X3 = 6.0      # объём двигателя, л
MAX_X4 = 2500.0   # масса, кг
MAX_X5 = 15.0     # расход масла

FEATURE_MAX = [MAX_X1, MAX_X2, MAX_X3, MAX_X4, MAX_X5]

#Нормировка признаков
def normalize(*features):

    return tuple(f / m for f, m in zip(features, FEATURE_MAX))


TRAIN_RAW = [
    # Класс 1 — Экономный
    (5.2,  90, 1.4, 1100, 12.5, 1),
    (4.8,  75, 2.0, 1050, 13.8, 1),
    (6.1, 110, 1.2, 1400, 10.2, 1),
    (5.5, 140, 1.5, 1150, 12.0, 1),
    (4.5,  68, 1.1, 1000, 14.5, 1),
    (6.5, 130, 1.8, 1250, 10.5, 1),
    # Класс 2 — Спортивный
    (13.5, 320, 3.5, 1600,  5.2, 2),
    (15.2, 380, 2.8, 1750,  4.1, 2),
    (12.8, 290, 4.2, 1400,  5.8, 2),
    (14.0, 350, 3.8, 1700,  4.5, 2),
    (11.5, 260, 2.5, 1550,  6.3, 2),
    (16.5, 400, 4.2, 1800,  3.9, 2),
]

UNKNOWN_RAW = [
    ("Хэтчбек",   5.5, 100, 1.4, 1150, 12.0),
    ("Спорткар",           14.5, 340, 3.8, 1650,  4.3),
    ("Кроссовер",           8.0, 180, 2.0, 1700, 10.0),
    ("Гибрид",              4.2,  85, 1.5, 1300, 11.5),
    ("Седан", 10.5, 240, 2.5, 1600,  7.5),
]

#Нормированное обучающее множество
def get_train_set():
    return [(*normalize(x1, x2, x3, x4, x5), c)
            for x1, x2, x3, x4, x5, c in TRAIN_RAW]

#Нормированные объекты для распознавания
def get_unknown_set():
    return [(name, *normalize(x1, x2, x3, x4, x5))
            for name, x1, x2, x3, x4, x5 in UNKNOWN_RAW]